[
	{
		"name": "Romanian IT Companies Dashboard",
		"image": "companies.png",
		"technologies": [
			"Node.js",
			"TypeScript",
			"SQLite",
			"React",
			"AWS",
			"Nginx"
		],
		"description": "A dashboard to search for IT companies in Romania and view financial data.",
		"longDescription": "A full-stack application built using Node.js and React that combines public data from two datasets on data.gov.ro, one containing financial indicators and the other with company details such as location, which are joined by the unique company identifier (CUI). The application presents this data in a comprehensive dashboard. Users can filter the data by various indicators and view statistics about these companies.",
		"purpose": "To provide access to public financial information about Romanian IT companies in a free, user-friendly format.",
		"features": [
			"A table to view and sort company data",
			"Filter options to refine company search based on multiple criteria such as number of employees, CAEN code, CUI, and revenue",
			"Statistics page with insights like total employees, average revenue, etc.",
			"Responsive design and dark mode"
		],
		"technologiesDetailed": [
			"Backend: Node.js with Express and SQLite for the database",
			"Frontend: React for the UI, with Redux for state management",
			"Hosting: Deployed on an AWS EC2 instance with Nginx as a reverse proxy"
		],
		"linkCode": "https://github.com/AndreiMorariu/companies_finder",
		"linkProject": "http://35.158.2.69/"
	},
	{
		"name": "Fitness Tracker",
		"image": "fitness-tracker.png",
		"technologies": ["React", "Tailwind", "shadcn/ui", "AI Integration"],
		"description": "An application to track workouts, set goals, and get AI-generated workout recommendations.",
		"longDescription": "A single-page React application that allows users to log workouts, set fitness goals, and get AI-generated workout routines based on user preferences. The app displays detailed statistics about users' fitness progress and provides insights to help achieve goals faster.",
		"purpose": "To help users track their fitness progress, set personalized goals, and improve their health with AI-powered workout suggestions.",
		"features": [
			"Dashboard with workout statistics, including total workout time, favorite exercises, and active days",
			"Create custom workouts (cardio, strength training, flexibility)",
			"AI-generated workouts based on user preferences",
			"Goal tracking with progress monitoring",
			"Responsive design and dark mode"
		],
		"technologiesDetailed": [
			"Frontend: React for the UI and state management using hooks",
			"AI integration: Uses a simple AI algorithm to generate workout suggestions",
			"Charts: Utilizes charting libraries to display workout statistics"
		],
		"linkCode": "https://github.com/AndreiMorariu/FitTrack",
		"linkProject": "https://fit-track-zthw.vercel.app"
	},
	{
		"name": "Job Application Tracker",
		"image": "application-tracker.png",
		"technologies": [
			"C#",
			"ASP.NET Core",
			"SQL Server",
			"React",
			"Material UI"
		],
		"description": "A tool to keep track of job applications.",
		"longDescription": "A full-stack application built using C# and React to help users track and manage job applications. It includes features like a dashboard, statistics, and charts to visualize application progress.",
		"purpose": "To have a personal centralized place to manage job applications across various platforms.",
		"features": [
			"Dashboard with table to add/edit/remove applications",
			"Statistics page with visualizations for average applications per month and more",
			"Responsive design and dark mode"
		],
		"technologiesDetailed": [
			"Backend: ASP.NET Core for API development",
			"Database: SQL Server for persistent storage",
			"Frontend: React with hooks and context for state management"
		],
		"linkCode": "https://github.com/AndreiMorariu/Job-Tracker-Fullstack",
		"linkProject": "https://application-manager-seven.vercel.app"
	}
]
